per_cent = {'ТКБ': 5.6, 'СКБ': 5.9, 'ВТБ': 4.28, 'СБЕР': 4.0}
print("Годовые процентные ставки в разных банках - ", per_cent)
M = input("Введите сумму которыю Вы хотите положить на депозит:")
M_float = float(M)
N = M_float/100
deposit=[int(per_cent['ТКБ']*N), int(per_cent['СКБ']*N), int(per_cent['ВТБ']*N), int(per_cent['СБЕР']*N)]
print("Суммы которые Вы заработаете, положив на депозит в разных банках - ", deposit)
MM=max(deposit)
print("Максимальная сумма, которую вы cможете заработать — ", MM)