#Для онлайн-конференции необходимо написать программу, которая будет подсчитывать общую стоимость билетов.
# Программа должна работать следующим образом: 1. В начале у пользователя запрашивается количество билетов, которые
# он хочет приобрести на мероприятие. 2. Далее для каждого билета запрашивается возраст посетителя, в соответствии
# со значением которого выбирается стоимость: Если посетителю конференции менее 18 лет, то он проходит на конференцию бесплатно.
# От 18 до 25 лет — 990 руб.
# От 25 лет — полная стоимость 1390 руб. 3. В результате программы выводится сумма к оплате. При этом, если человек
# регистрирует больше трёх человек на конференцию, то дополнительно получает 10% скидку на полную стоимость заказа.
N_tickets = int(input('Сколько билетов на мероприятие Вы хотите приобрести:'))
L = [int(input(f'Введите возраст {i} участника:')) for i in range(1, N_tickets+1)]
price = 0
for i in range(1, N_tickets+1):
    if 18 <= L[i-1] <= 25:
        price += 990
        print(f'Стоимость без скидки за {i} участника {price} рублей')
    elif L[i-1] < 18:
        print(f'{i} участник учавствует в конференции бесплатно')
    else:
        price += 1390
        print(f'Стоимость без скидки за {i} участника {price} рублей')
if N_tickets > 3:
    print(f'Полная стоимость билетов со скидкой за {N_tickets} участников {price*0.9} рублей')
else:
    print(f'Полная стоимость билетов за {N_tickets} участников {price} рублей')